# Case Study on Attrition

In [9]:
url = "https://raw.githubusercontent.com/dupadhyaya/hrAnalytics/main/data/attrition/HR_attr1.csv"

In [4]:
import numpy as np
import pandas as pd

In [10]:
df=pd.read_csv(url)
df.info

<bound method DataFrame.info of        satisfaction_level  last_evaluation  number_project  \
0                    0.38             0.53               2
1                    0.80             0.86               5
2                    0.11             0.88               7
3                    0.72             0.87               5
4                    0.37             0.52               2
...                   ...              ...             ...
14994                0.40             0.57               2
14995                0.37             0.48               2
14996                0.37             0.53               2
14997                0.11             0.96               6
14998                0.37             0.52               2

       average_montly_hours  time_spend_company  Work_accident  \
0                       157                   3              0
1                       262                   6              0
2                       272                   4              0
3                       223                   5              0
4                       159                   3              0
...                     ...                 ...            ...
14994                   151                   3              0
14995                   160                   3              0
14996                   143                   3              0
14997                   280                   4              0
14998                   158                   3              0

       promotion_last_5years  salary  left
0                          0     low     1
1                          0  medium     1
2                          0  medium     1
3                          0     low     1
4                          0     low     1
...                      ...     ...   ...
14994                      0     low     1
14995                      0     low     1
14996                      0     low     1
14997                      0     low     1
14998                      0     low     1

[14999 rows x 9 columns]>

In [11]:
df.shape

(14999, 9)

In [12]:
df.columns

Index(['satisfaction_level', 'last_evaluation', 'number_project',
       'average_montly_hours', 'time_spend_company', 'Work_accident',
       'promotion_last_5years', 'salary', 'left'],
      dtype='object')

In [13]:
df.head

<bound method NDFrame.head of        satisfaction_level  last_evaluation  number_project  \
0                    0.38             0.53               2
1                    0.80             0.86               5
2                    0.11             0.88               7
3                    0.72             0.87               5
4                    0.37             0.52               2
...                   ...              ...             ...
14994                0.40             0.57               2
14995                0.37             0.48               2
14996                0.37             0.53               2
14997                0.11             0.96               6
14998                0.37             0.52               2

       average_montly_hours  time_spend_company  Work_accident  \
0                       157                   3              0
1                       262                   6              0
2                       272                   4              0
3                       223                   5              0
4                       159                   3              0
...                     ...                 ...            ...
14994                   151                   3              0
14995                   160                   3              0
14996                   143                   3              0
14997                   280                   4              0
14998                   158                   3              0

       promotion_last_5years  salary  left
0                          0     low     1
1                          0  medium     1
2                          0  medium     1
3                          0     low     1
4                          0     low     1
...                      ...     ...   ...
14994                      0     low     1
14995                      0     low     1
14996                      0     low     1
14997                      0     low     1
14998                      0     low     1

[14999 rows x 9 columns]>

In [29]:
df.left.value_counts()

left
0    11428
1     3571
Name: count, dtype: int64

In [16]:
df.groupby('left').size()

left
0    11428
1     3571
dtype: int64

In [17]:
df.groupby('left').agg('count')

,satisfaction_level,last_evaluation,number_project,average_montly_hours,time_spend_company,Work_accident,promotion_last_5years,salary
left,,,,,,,,
0,11428,11428,11428,11428,11428,11428,11428,11428
1,3571,3571,3571,3571,3571,3571,3571,3571

In [25]:
df.left.value_counts(normalize=True)

left
0    0.761917
1    0.238083
Name: proportion, dtype: float64

In [28]:
3571/15000 #manual calculation is done to cross check the percentage

0.23806666666666668

In [27]:
11428/15000*100 #manual calculation is done to cross check the percentage

76.18666666666667

In [31]:
df.left.value_counts(normalize=True,sort=True,ascending=True)

left
1    0.238083
0    0.761917
Name: proportion, dtype: float64

In [32]:
df.left.value_counts(normalize=True,sort=True,ascending=False)

left
0    0.761917
1    0.238083
Name: proportion, dtype: float64

In [35]:
df.salary.value_counts()

salary
low       7316
medium    6446
high      1237
Name: count, dtype: int64

In [37]:
df.salary.value_counts(ascending=True)

salary
high      1237
medium    6446
low       7316
Name: count, dtype: int64

In [38]:
df.salary.value_counts(ascending=False)

salary
low       7316
medium    6446
high      1237
Name: count, dtype: int64

In [39]:
df.salary.value_counts(normalize=True)

salary
low       0.487766
medium    0.429762
high      0.082472
Name: proportion, dtype: float64

In [40]:
df.salary.value_counts(normalize=True,sort=True,ascending=True)

salary
high      0.082472
medium    0.429762
low       0.487766
Name: proportion, dtype: float64

In [41]:
df.salary.value_counts(normalize=True,sort=True,ascending=False)

salary
low       0.487766
medium    0.429762
high      0.082472
Name: proportion, dtype: float64

In [42]:
df.describe

<bound method NDFrame.describe of        satisfaction_level  last_evaluation  number_project  \
0                    0.38             0.53               2
1                    0.80             0.86               5
2                    0.11             0.88               7
3                    0.72             0.87               5
4                    0.37             0.52               2
...                   ...              ...             ...
14994                0.40             0.57               2
14995                0.37             0.48               2
14996                0.37             0.53               2
14997                0.11             0.96               6
14998                0.37             0.52               2

       average_montly_hours  time_spend_company  Work_accident  \
0                       157                   3              0
1                       262                   6              0
2                       272                   4              0
3                       223                   5              0
4                       159                   3              0
...                     ...                 ...            ...
14994                   151                   3              0
14995                   160                   3              0
14996                   143                   3              0
14997                   280                   4              0
14998                   158                   3              0

       promotion_last_5years  salary  left
0                          0     low     1
1                          0  medium     1
2                          0  medium     1
3                          0     low     1
4                          0     low     1
...                      ...     ...   ...
14994                      0     low     1
14995                      0     low     1
14996                      0     low     1
14997                      0     low     1
14998                      0     low     1

[14999 rows x 9 columns]>

In [44]:
df.dtypes

satisfaction_level       float64
last_evaluation          float64
number_project             int64
average_montly_hours       int64
time_spend_company         int64
Work_accident              int64
promotion_last_5years      int64
salary                    object
left                       int64
dtype: object

In [46]:
df[['satisfaction_level','time_spend_company']].mean()

satisfaction_level    0.612834
time_spend_company    3.498233
dtype: float64

In [48]:
df.select_dtypes('number').mean()

satisfaction_level         0.612834
last_evaluation            0.716102
number_project             3.803054
average_montly_hours     201.050337
time_spend_company         3.498233
Work_accident              0.144610
promotion_last_5years      0.021268
left                       0.238083
dtype: float64

In [54]:
df.select_dtypes('number').agg(['mean','min','max','std','count'])

,satisfaction_level,last_evaluation,number_project,average_montly_hours,time_spend_company,Work_accident,promotion_last_5years,left
mean,0.612834,0.716102,3.803054,201.050337,3.498233,0.144610,0.021268,0.238083
min,0.090000,0.360000,2.000000,96.000000,2.000000,0.000000,0.000000,0.000000
max,1.000000,1.000000,7.000000,310.000000,10.000000,1.000000,1.000000,1.000000
std,0.248631,0.171169,1.232592,49.943099,1.460136,0.351719,0.144281,0.425924
count,14999.000000,14999.000000,14999.000000,14999.000000,14999.000000,14999.000000,14999.000000,14999.000000

In [61]:
df.groupby('salary').agg(meanSatLevel = ('satisfaction_level','mean'))

        meanSatLevel
salary
high        0.637470
low         0.600753
medium      0.621817

In [65]:
df.groupby('salary').agg(meanSatLevel = ('satisfaction_level','mean'),promL5Y = ('promotion_last_5years','mean'))

        meanSatLevel   promL5Y
salary
high        0.637470  0.058205
low         0.600753  0.009021
medium      0.621817  0.028079

In [66]:
df.groupby('salary').agg(meanSatLevel = ('satisfaction_level','mean'),promL5Y = ('promotion_last_5years','sum'))

        meanSatLevel  promL5Y
salary
high        0.637470       72
low         0.600753       66
medium      0.621817      181

In [69]:
df['promotion_last_5years'].value_counts()

promotion_last_5years
0    14680
1      319
Name: count, dtype: int64

In [71]:
72+66+181 #cross checking manually

319

In [75]:
df.groupby('salary').agg(count = ('salary','count'))

        count
salary
high     1237
low      7316
medium   6446

In [80]:
df.groupby('salary').agg(count = ('salary','count'), promL5Y = ('promotion_last_5years','sum'), meanSatLevel =('satisfaction_level','mean'))

        count  promL5Y  meanSatLevel
salary
high     1237       72      0.637470
low      7316       66      0.600753
medium   6446      181      0.621817